{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v4.17.0", "signature": {"inputs": {"xs_1": {"name": "xs_1:0", "dtype": "DT_BOOL", "tensorShape": {"dim": [{"size": "9"}]}}, "xs_0": {"name": "xs_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "29"}]}}}, "outputs": {"output_1": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {}}, "output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_head/Actor_Head/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "9"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_0/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_head/pjit__where_/BroadcastTo", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Cast_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_13/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Cast_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_7/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_21/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_1/pjit_fn_/AddV2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_11/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_gate_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_17/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_16/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_5/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Cast_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_12/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Cast_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_6/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_0/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_19/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_0/pjit_fn_/AddV2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_10/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_gate_0/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_15/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_14/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_4/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/Dense_0/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_3/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "29"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_head/Critic_Head/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_23/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_22/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_head/pjit__squeeze_/Reshape/shape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "xs_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "29"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "xs_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "9"}]}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/Dense_0/ExpandDims", "op": "ExpandDims", "input": ["xs_0", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/Dense_0/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/Dense_0/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/Dense_0/ExpandDims", "StatefulPartitionedCall/jax2tf_arg_3/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/Dense_0/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/Dense_0/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["0"]}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/Dense_0/pjit_fn_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/Dense_0/Squeeze", "StatefulPartitionedCall/jax2tf_arg_2/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/NotEqual", "op": "NotEqual", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/Dense_0/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/Dense_0/pjit_fn_/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/Dense_0/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Abs", "op": "Abs", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/Dense_0/pjit_fn_/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Abs"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Exp", "op": "Exp", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Log1p", "op": "Log1p", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Exp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/AddV2_1", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Maximum", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Log1p"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/NotEqual", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/Dense_0/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/AddV2_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_tanh_/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/SelectV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/Dense_0/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_tanh_/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/Mul", "StatefulPartitionedCall/jax2tf_arg_6/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_0/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_0/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_0/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_0/ExpandDims", "StatefulPartitionedCall/jax2tf_arg_19/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_0/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_0/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["0"]}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/AddV2_1", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_0/Squeeze", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_0/pjit_fn_/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/NotEqual_1", "op": "NotEqual", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/AddV2_1", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/AddV2_1"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Maximum_1", "op": "Maximum", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/AddV2_1", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Cast_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Abs_1", "op": "Abs", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/AddV2_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Neg_1", "op": "Neg", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Abs_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Exp_1", "op": "Exp", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Neg_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Log1p_1", "op": "Log1p", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Exp_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/AddV2_3", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Maximum_1", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Log1p_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/SelectV2_1", "op": "SelectV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/NotEqual_1", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/AddV2_1", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/AddV2_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_tanh_/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/SelectV2_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/Mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/AddV2_1", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_tanh_/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/AddV2_2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/Mul_1", "StatefulPartitionedCall/jax2tf_arg_10/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_gate_0/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/AddV2_2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_gate_0/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_gate_0/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_gate_0/ExpandDims", "StatefulPartitionedCall/jax2tf_arg_15/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_gate_0/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_gate_0/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["0"]}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_gate_0/pjit_fn_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_gate_0/Squeeze", "StatefulPartitionedCall/jax2tf_arg_14/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/Mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_gate_0/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_arg_4/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_AddV2_4", "op": "AddN", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/Mul_2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/Mul"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/ArithmeticOptimizer/AddOpsRewrite_AddV2_4", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_arg_12/ReadVariableOp", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_AddV2_4"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/NotEqual_2", "op": "NotEqual", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/ArithmeticOptimizer/AddOpsRewrite_AddV2_4", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/ArithmeticOptimizer/AddOpsRewrite_AddV2_4"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Maximum_2", "op": "Maximum", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/ArithmeticOptimizer/AddOpsRewrite_AddV2_4", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Cast_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Abs_2", "op": "Abs", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/ArithmeticOptimizer/AddOpsRewrite_AddV2_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Neg_2", "op": "Neg", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Abs_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Exp_2", "op": "Exp", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Neg_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Log1p_2", "op": "Log1p", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Exp_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/AddV2_5", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Maximum_2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Log1p_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/SelectV2_2", "op": "SelectV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/NotEqual_2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/ArithmeticOptimizer/AddOpsRewrite_AddV2_4", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/AddV2_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_tanh_/Tanh_2", "op": "Tanh", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/SelectV2_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/Mul_3", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/ArithmeticOptimizer/AddOpsRewrite_AddV2_4", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_tanh_/Tanh_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/AddV2_5", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/Mul_3", "StatefulPartitionedCall/jax2tf_arg_7/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/AddV2_5", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_1/ExpandDims", "StatefulPartitionedCall/jax2tf_arg_21/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_1/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["0"]}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/AddV2_6", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_1/Squeeze", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_1/pjit_fn_/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/NotEqual_3", "op": "NotEqual", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/AddV2_6", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/AddV2_6"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Maximum_3", "op": "Maximum", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/AddV2_6", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Cast_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Abs_3", "op": "Abs", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/AddV2_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Neg_3", "op": "Neg", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Abs_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Exp_3", "op": "Exp", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Neg_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Log1p_3", "op": "Log1p", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Exp_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/AddV2_7", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Maximum_3", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Log1p_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/SelectV2_3", "op": "SelectV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/NotEqual_3", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/AddV2_6", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/AddV2_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_tanh_/Tanh_3", "op": "Tanh", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/SelectV2_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/Mul_4", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/AddV2_6", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_tanh_/Tanh_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/AddV2_7", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/Mul_4", "StatefulPartitionedCall/jax2tf_arg_11/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_gate_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/AddV2_7", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_gate_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_gate_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_gate_1/ExpandDims", "StatefulPartitionedCall/jax2tf_arg_17/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_gate_1/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_gate_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["0"]}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_gate_1/pjit_fn_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_gate_1/Squeeze", "StatefulPartitionedCall/jax2tf_arg_16/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/Mul_5", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_gate_1/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_arg_5/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_AddV2_9", "op": "AddN", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/Mul_5", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/Mul_3"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/ArithmeticOptimizer/AddOpsRewrite_AddV2_9", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_arg_13/ReadVariableOp", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_AddV2_9"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/NotEqual_4", "op": "NotEqual", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/ArithmeticOptimizer/AddOpsRewrite_AddV2_9", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/ArithmeticOptimizer/AddOpsRewrite_AddV2_9"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Maximum_4", "op": "Maximum", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/ArithmeticOptimizer/AddOpsRewrite_AddV2_9", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Cast_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Abs_4", "op": "Abs", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/ArithmeticOptimizer/AddOpsRewrite_AddV2_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Neg_4", "op": "Neg", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Abs_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Exp_4", "op": "Exp", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Neg_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Log1p_4", "op": "Log1p", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Exp_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/AddV2_9", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Maximum_4", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Log1p_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/SelectV2_4", "op": "SelectV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/NotEqual_4", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/ArithmeticOptimizer/AddOpsRewrite_AddV2_9", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/AddV2_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_tanh_/Tanh_4", "op": "Tanh", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/SelectV2_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/Mul_6", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/ArithmeticOptimizer/AddOpsRewrite_AddV2_9", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_tanh_/Tanh_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_head/Actor_Head/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/Mul_6", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_head/Actor_Head/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_head/Critic_Head/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_fn_/Mul_6", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_head/Critic_Head/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_head/Actor_Head/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_head/Actor_Head/ExpandDims", "StatefulPartitionedCall/jax2tf_arg_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_head/Critic_Head/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_head/Critic_Head/ExpandDims", "StatefulPartitionedCall/jax2tf_arg_23/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_head/Actor_Head/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_head/Actor_Head/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["0"]}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_head/Critic_Head/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_head/Critic_Head/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["0"]}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_head/Actor_Head/pjit_fn_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_head/Actor_Head/Squeeze", "StatefulPartitionedCall/jax2tf_arg_0/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_head/Critic_Head/pjit_fn_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_head/Critic_Head/Squeeze", "StatefulPartitionedCall/jax2tf_arg_22/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_head/pjit__where_/SelectV2", "op": "SelectV2", "input": ["xs_1", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_head/Actor_Head/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_head/pjit__where_/BroadcastTo"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_head/pjit__squeeze_/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_head/Critic_Head/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_head/pjit__squeeze_/Reshape/shape_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_head/pjit__where_/SelectV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_head/pjit__squeeze_/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1482}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_head/Actor_Head/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_1/ReadVariableOp", "shape": [128, 9], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_0/ReadVariableOp", "shape": [9], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_head/pjit__where_/BroadcastTo", "shape": [9], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Cast_4", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_13/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Cast_3", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_7/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_1/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_21/ReadVariableOp", "shape": [128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_1/pjit_fn_/AddV2", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_11/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_gate_1/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_17/ReadVariableOp", "shape": [128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_16/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_5/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Cast_2", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_12/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Cast_1", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_6/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_0/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_19/ReadVariableOp", "shape": [128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_middle_0/pjit_fn_/AddV2", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_10/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/layer_gate_0/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_15/ReadVariableOp", "shape": [128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_14/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_4/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/pjit_softplus_/pjit_logaddexp_/Cast", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/body/Dense_0/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_3/ReadVariableOp", "shape": [29, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_2/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_head/Critic_Head/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_23/ReadVariableOp", "shape": [128, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_22/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_head/pjit__squeeze_/Reshape/shape_1", "shape": [0], "dtype": "int32"}]}]}